In [31]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Asha', 'Ravi', 'Karan', 'Meena', 'Arjun'],
    'Age': [23, 25, 22, 24, 26],
    'Marks': [85, 78, 92, 70, 88],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Chennai', 'Mumbai']
}

df = pd.DataFrame(data)
df.index = ['a','b','c','d','e']

df

    Name  Age  Marks     City
a   Asha   23     85    Delhi
b   Ravi   25     78   Mumbai
c  Karan   22     92    Delhi
d  Meena   24     70  Chennai
e  Arjun   26     88   Mumbai

Q1. Select column Marks using bracket notation

In [32]:
df['Marks']

a    85
b    78
c    92
d    70
e    88
Name: Marks, dtype: int64

Q2. Select columns Name and Age

In [33]:
df[['Name', 'Age']]

    Name  Age
a   Asha   23
b   Ravi   25
c  Karan   22
d  Meena   24
e  Arjun   26

Q3. Select row with index label 'c'

In [34]:
df.loc['c']

Name     Karan
Age         22
Marks       92
City     Delhi
Name: c, dtype: object

Q4. Select rows from 'b' to 'd' using slicing

In [35]:
df.loc['b':'d']

    Name  Age  Marks     City
b   Ravi   25     78   Mumbai
c  Karan   22     92    Delhi
d  Meena   24     70  Chennai

Q5. What is the difference between df[&#39;Age&#39;] and df[[&#39;Age&#39;]]?

In [36]:
df['Age']

a    23
b    25
c    22
d    24
e    26
Name: Age, dtype: int64

In [37]:
df[['Age']]

   Age
a   23
b   25
c   22
d   24
e   26

Q6. Select row 'd' and column 'Marks' using .loc

In [38]:
df.loc['d', 'Marks']

np.int64(70)

Q7. Select value at position (row 2, column 1) using .iloc

In [39]:
df.iloc[2, 1]

np.int64(22)

Q8. Select first 3 rows and first 2 columns using .iloc

In [40]:
df.iloc[0:3, 0:2]

    Name  Age
a   Asha   23
b   Ravi   25
c  Karan   22

Q9. Select rows 'a' to 'c' and columns 'Name' and 'Marks'

In [41]:
df.loc['a':'c', ['Name', 'Marks']]

    Name  Marks
a   Asha     85
b   Ravi     78
c  Karan     92

Q10. Difference between .loc slicing and .iloc slicing

In [42]:
df.loc['a':'c']

    Name  Age  Marks    City
a   Asha   23     85   Delhi
b   Ravi   25     78  Mumbai
c  Karan   22     92   Delhi

In [43]:
df.iloc[0:3]

    Name  Age  Marks    City
a   Asha   23     85   Delhi
b   Ravi   25     78  Mumbai
c  Karan   22     92   Delhi

Q11. Use .at and .iat to select single scalar value

In [44]:
df.at['b', 'Age']

np.int64(25)

In [45]:
df.iat[1, 1]

np.int64(25)

Q12. Select students with Marks > 80

In [46]:
df[df['Marks'] > 80]

    Name  Age  Marks    City
a   Asha   23     85   Delhi
c  Karan   22     92   Delhi
e  Arjun   26     88  Mumbai

Q13. Select students from Mumbai

In [47]:
df[df['City'] == 'Mumbai']

    Name  Age  Marks    City
b   Ravi   25     78  Mumbai
e  Arjun   26     88  Mumbai

Q14. Select students whose Age is between 23 and 25

In [48]:
df[(df['Age'] >= 23) & (df['Age'] <= 25)]

    Name  Age  Marks     City
a   Asha   23     85    Delhi
b   Ravi   25     78   Mumbai
d  Meena   24     70  Chennai

Q15. Students from Delhi AND Marks > 80

In [49]:
df[(df['City'] == 'Delhi') & (df['Marks'] > 80)]

    Name  Age  Marks   City
a   Asha   23     85  Delhi
c  Karan   22     92  Delhi

Q16. Replace Marks < 75 with NaN

In [50]:
df.loc[df['Marks'] < 75, 'Marks'] = np.nan
df

    Name  Age  Marks     City
a   Asha   23   85.0    Delhi
b   Ravi   25   78.0   Mumbai
c  Karan   22   92.0    Delhi
d  Meena   24    NaN  Chennai
e  Arjun   26   88.0   Mumbai

Q17. Reindex to include new index 'f'

In [51]:
df = df.reindex(['a','b','c','d','e','f'])
df

    Name   Age  Marks     City
a   Asha  23.0   85.0    Delhi
b   Ravi  25.0   78.0   Mumbai
c  Karan  22.0   92.0    Delhi
d  Meena  24.0    NaN  Chennai
e  Arjun  26.0   88.0   Mumbai
f    NaN   NaN    NaN      NaN

Q18. Reorder index

In [52]:
df = df.reindex(['e','d','c','b','a'])
df

    Name   Age  Marks     City
e  Arjun  26.0   88.0   Mumbai
d  Meena  24.0    NaN  Chennai
c  Karan  22.0   92.0    Delhi
b   Ravi  25.0   78.0   Mumbai
a   Asha  23.0   85.0    Delhi

Q19. Add new column Grade using reindex

In [53]:
df = df.reindex(columns=['Name','Age','Marks','City','Grade'])
df

    Name   Age  Marks     City  Grade
e  Arjun  26.0   88.0   Mumbai    NaN
d  Meena  24.0    NaN  Chennai    NaN
c  Karan  22.0   92.0    Delhi    NaN
b   Ravi  25.0   78.0   Mumbai    NaN
a   Asha  23.0   85.0    Delhi    NaN

Q21. Use method='ffill' while reindexing

In [ ]:
df1 = df.reindex(['a','b','c','d','e','f'])
print(df1)
print(df1.ffill())

    Name   Age  Marks     City  Grade
a   Asha  23.0   85.0    Delhi    NaN
b   Ravi  25.0   78.0   Mumbai    NaN
c  Karan  22.0   92.0    Delhi    NaN
d  Meena  24.0   88.0  Chennai    NaN
e  Arjun  26.0   88.0   Mumbai    NaN
f  Arjun  26.0   88.0   Mumbai    NaN

Q22. Drop row 'c'

In [55]:
df.drop('c')

    Name   Age  Marks     City  Grade
e  Arjun  26.0   88.0   Mumbai    NaN
d  Meena  24.0    NaN  Chennai    NaN
b   Ravi  25.0   78.0   Mumbai    NaN
a   Asha  23.0   85.0    Delhi    NaN

Q23. Drop column 'City'

In [56]:
df.drop('City', axis=1)

    Name   Age  Marks  Grade
e  Arjun  26.0   88.0    NaN
d  Meena  24.0    NaN    NaN
c  Karan  22.0   92.0    NaN
b   Ravi  25.0   78.0    NaN
a   Asha  23.0   85.0    NaN

Q24. Drop rows 'a' and 'b' together

In [57]:
df.drop(['a','b'])

    Name   Age  Marks     City  Grade
e  Arjun  26.0   88.0   Mumbai    NaN
d  Meena  24.0    NaN  Chennai    NaN
c  Karan  22.0   92.0    Delhi    NaN

Q25. Drop column 'Age' using axis=1

In [58]:
df.drop('Age', axis=1)

    Name  Marks     City  Grade
e  Arjun   88.0   Mumbai    NaN
d  Meena    NaN  Chennai    NaN
c  Karan   92.0    Delhi    NaN
b   Ravi   78.0   Mumbai    NaN
a   Asha   85.0    Delhi    NaN

Q26. Difference between axis=0 and axis=1

In [59]:
df.drop('a', axis=0)

    Name   Age  Marks     City  Grade
e  Arjun  26.0   88.0   Mumbai    NaN
d  Meena  24.0    NaN  Chennai    NaN
c  Karan  22.0   92.0    Delhi    NaN
b   Ravi  25.0   78.0   Mumbai    NaN

In [ ]:
df.drop('Age', axis=1)

    Name  Marks     City  Grade
e  Arjun   88.0   Mumbai    NaN
d  Meena    NaN  Chennai    NaN
c  Karan   92.0    Delhi    NaN
b   Ravi   78.0   Mumbai    NaN
a   Asha   85.0    Delhi    NaN